{"apple": "A fruit that is typically round, red, and edible.", "banana": "A long curved fruit with a yellow skin.", "cat": "A small domesticated carnivorous mammal.", "dog": "A domesticated carnivorous mammal that typically has a long snout, an acute sense of smell, and a barking, howling, or whining voice.", "elephant": "A very large plant-eating mammal with a trunk and long curved ivory tusks.", "fish": "A limbless cold-blooded vertebrate animal with gills and fins living wholly in water.", "giraffe": "A large African mammal with a very long neck and forelegs, having a coat patterned with brown patches separated by lighter lines.", "horse": "A large plant-eating domesticated mammal with solid hooves and a flowing mane and tail, used for riding, racing, and to carry and pull loads.", "igloo": "A dome-shaped Eskimo house, typically built from blocks of solid snow.", "jaguar": "A large, heavily built cat that has a yellowish-brown coat with black spots, found mainly in the dense forests of Central and South America.", "koala": "An Australian tree-dwelling marsupial that has a backward-facing pouch, feeds on eucalyptus leaves, and is noted for its sluggish behavior.", "lion": "A large tawny-colored cat that lives in prides, found in Africa and northwestern India.", "monkey": "A small to medium-sized primate that typically has a long tail, most kinds of which live in trees in tropical countries.", "narwhal": "A small Arctic whale that has a long tusk-like tooth, usually in the male, that projects from the left side of the upper jaw.", "ostrich": "A flightless swift-running African bird with a long neck, long legs, and two toes on each foot. It is the largest living bird, with males reaching an average height of 8 feet.", "penguin": "A flightless seabird of the Southern Hemisphere, known for its black-and-white plumage and its upright posture.", "quokka": "A small marsupial with a short tail, found in Western Australia. It is a herbivorous and mainly nocturnal animal, and is known for its friendly and approachable behavior.", "rabbit": "A small burrowing mammal with long ears, soft fur, and a divided upper lip, native to Eurasia and Africa and widely kept as a pet or for food.", "snake": "A long limbless reptile that has no eyelids, a short tail, and jaws that are capable of considerable extension. Some snakes have a venomous bite.", "tiger": "A large carnivorous cat that is native to Asia, with a distinctive orange coat with black stripes. It is an endangered species.", "umbrella": "A device consisting of a circular canopy of cloth on a folding metal frame supported by a central rod, used as protection against rain.", "vulture": "A large bird of prey that feeds primarily on carrion, having a bald head and weak claws, and usually soaring or circling above its prey.", "whale": "A very large marine mammal with a streamlined hairless body, a horizontal tail fin, and a blowhole on top of the head for breathing.", "xylophone": "A musical instrument played by striking a row of wooden"}